List<String> azkarPrayer = [
  " أسـتغفر الله،  أسـتغفر الله،  أسـتغفر الله.اللهـم أنـت السلام ، ومـنك السلام ، تباركت يا ذا الجـلال والإكـرام .",
  "لا إله إلا الله وحده لا شريك له، له المـلك وله الحمد، وهو على كل شيء قدير، اللهـم لا مانع لما أعطـيت، ولا معطـي لما منـعت، ولا ينفـع ذا الجـد منـك الجـد.",
  "لا إله إلا الله, وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، لا حـول ولا قـوة إلا بالله، لا إله إلا اللـه، ولا نعـبـد إلا إيـاه, له النعـمة وله الفضل وله الثـناء الحـسن، لا إله إلا الله مخلصـين لـه الدين ولو كـره الكـافرون.",
  "سـبحان الله.",
  "الحمـد لله.",
  "الله أكـبر.",
  "لا إله إلا الله وحـده لا شريك له، له الملك وله الحمد، وهو على كل شيء قـدير.",
  "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم\n"
      "قُلْ هُوَ اللَّهُ أَحَدٌ ﴿۱﴾ اللَّهُ الصَّمَدُ ﴿۲﴾ لَمْ يَلِدْ وَلَمْ يُولَدْ﴿۳﴾ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ﴿٤﴾.",
  "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم\n"
      "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ﴿۱﴾ مِنْ شَرِّ مَا خَلَقَ ﴿۲﴾ وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ﴿۳﴾ وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ﴿٤﴾ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ ﴿٥﴾.",
  "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم\n"
      "قُلْ أَعُوذُ بِرَبِّ النَّاسِ ﴿۱﴾ مَلِكِ النَّاسِ ﴿۲﴾ إِلَهِ النَّاسِ ﴿۳﴾ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ﴿٤﴾ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ﴿٥﴾ مِنَ الْجِنَّةِ وَالنَّاسِ ﴿٦﴾.",
  "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ \n'الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم'",
  " لا إله إلا الله وحـده لا شريك له، له الملك وله الحمد، يحيـي ويمـيت وهو على كل شيء قدير.",
  " اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً.",
  "اللهم أجرني من النار. ",
  "اللهم أعني على ذكرك وشكرك وحسن عبادتك.",
];
List<String> azkarPrayerDes = [
  "",
  "",
  "",
  "",
  "",
  "",
  " ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى. ",
  " ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى. ",
  " ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى. ",
  "",
  "",
  "",
  " بَعْد السّلامِ من صَلاةِ الفَجْر. ",
  "بعد صلاة الصبح والمغرب. ",
  ""
];
List<String> azkarPrayerRepate = [
  '۱',
  '۱',
  '۱',
  '۳۳',
  '۳۳',
  '۳۳',
  '۱',
  '۳',
  '۳',
  '۳',
  '۱',
  '۱۰',
  '۱',
  '٧',
  '۱',
];
