class AppString {
  static const String KAboutText =
      'برنامج أذكار المسلم اليوميةُ هو رفيق كل مسلم الذي لايمكنك الاستغناء عنه في يومك حيث يذكرك بالاذكار التي يسن لكل مسلم ان يكون علي دراية بها من أذكار الصباح وأذكار المساء والاذكار المفروضة عقب كل صلاه كما يمكن التسبيح داخل البرنامج ومعرفة العدد الذي اتممتة من التسبيح.';
  static const String doneText =
      'المحافظة على ذكر الله تعالى فيها خيرا كثيرا في هذه الحياة وأجرا عظيما في الآخرة، وأذكار الصباح والمساء من أهم الأذكار التي ينبغي للمسلم أن يحافظ عليها. فمن فوائدها انشراح الصدر وطمأنينة القلب ومعية الله تعالى وذكره للعبد في الملأ الأعلى قال الله تعالى: الَّذِينَ آمَنُواْ وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللّهِ أَلاَ بِذِكْرِ اللّهِ تَطْمَئِنُّ الْقُلُوبُ {الرعد:28}.\n وقال رسول الله صلى الله عليه وسلم: يقول الله عز وجل أنا عند ظن عبدي بي، وأنا معه حين يذكرني إن ذكرني في نفسه ذكرته في نفسي، وإن ذكرني في ملأ ذكرته في ملأ هم خير منهم. الحديث رواه مسلم وغيره.';
  static const String KAboutText2 =
      'برنامج أذكار المسلم اليوميةُ هو صدقة جارية لكل اموات المسلمين ولكل من شارك هذا التطبيق لوجه الله تعالي.';
  static const String KAppRate = 'تقييم التطبيق';
  static const String KAppVersion = 'version : 1.0.3';
  static const String KAppRights =  'All Rights Reserved by Dev Taher Salah \u{1f60e}';
  static const String KPrayerAppBar =  'أذكار بعد الصلاة المكتوبة';
  static const String KAppAbout = 'عن البرنامج';
  static const String KDevlop = 'تطوير';
  static const String KContact = 'تواصل معنا';
  static const String KSadka = 'صدقة جارية';
  static const String Ksabah = 'أذكار الصباح';
  static const String KMessa = 'أذكار المساء';
  static const String KPrayer = 'أذكار الصلاة';
  static const String KSleep = 'أذكار النوم';
  static const String KOtherZakar = 'أذكار مختارة';
  static const String KRokia = 'الرقية الشرعية';
  static const String KCounter = 'المسبحةُ الالكترونية';
  static const String KSabhText = 'سبٌح';
  static const String KRestText = 'إعادة';
  static const String KAbout = 'عنـــــا';
  static const String KAzan = 'مواقيت الصلاة';
  static const String KSabahDaialogText = 'تهانينا باتمامك وردك اليومي من اذكار الصباح';
  static const String KMessaDaialogText = 'تهانينا باتمامك وردك اليومي من اذكار المساء';
  static const String KPrayerDaialogText = 'تهانينا باتمامك وردك اليومي من اذكار الصلاة';
  static const String KSleepDaialogText = 'تهانينا باتمامك وردك اليومي من اذكار النوم';
  static const String KAzkarDaialogText = 'تهانينا باتمامك وردك اليومي من الاذكار والادعية';
  static const String KRokiaDaialogText = 'تهانينا باتمامك الرقية الشرعية';
  static const String KForYou = 'تهنئة لك';
  static const String KZakarSabahFeaturesTitle = 'فضل الالتزام باذكار الصباح';
  static const String KZakarMessaFeaturesTitle = 'فضل الالتزام باذكار المساء';
  static const String KZakarPrayerFeaturesTitle = 'فضل الالتزام باذكار الصلاة';
  static const String KZakarFeaturesTitle = 'فضل الالتزام بالاذكار ';
  static const String KZakarSleepFeaturesTitle = 'فضل الالتزام باذكار النوم';
  static const String KRokiaFeaturesTitle = 'فضل الالتزام بالرقية الشرعية';
  static const String KZakarSleepFeaturesDes = """
  : قال الإمام النووي رحمه الله: [كتاب آداب النوم والاضطجاع.

عن البراء بن عازب رضي الله عنهما قال: (كان رسول الله صلى الله عليه وسلم إذا أوى إلى فراشه نام على شقه الأيمن، ثم قال: اللهم أسلمت نفسي إليك، ووجهت وجهي إليك، وفوضت أمري إليك، وألجأت ظهري إليك، رغبة ورهبة إليك، لا ملجأ ولا منجا منك إلا إليك، آمنت بكتابك الذي أنزلت، ونبيك الذي أرسلت) رواه البخاري.

وعنه قال: (قال لي رسول الله صلى الله عليه وسلم: إذا أتيت مضجعك فتوضأ وضوءك للصلاة ثم اضطجع على شقك الأيمن وقل)، وذكر الحديث، وفيه: (واجعلهن آخر ما تقول) متفق عليه.

وعن عائشة رضي الله عنها قالت: (كان النبي صلى الله عليه وسلم يصلي من الليل إحدى عشرة ركعة فإذا طلع الفجر صلى ركعتين خفيفتين ثم اضطجع على شقه الأيمن حتى يجيء المؤذن فيؤذنه) متفق عليه].

كتاب آخر من كتب رياض الصالحين للإمام النووي رحمه الله وفيه آداب النوم والاضطجاع، أي: ما ينبغي على المسلم إذا أراد أن ينام أن يصنع عند نومه.

والنوم كما هو معروف هو الموتة الصغرى، قال تعالى: {اللَّهُ يَتَوَفَّى الأَنْفُسَ حِينَ مَوْتِهَا وَالَّتِي لَمْ تَمُتْ فِي مَنَامِهَا} [الزمر:٤٢] فالمسلم حين يضع جانبه على فراشه يتخيل أن تكون هذه آخر نومة ينامها، فيمكن أن يقبضه الله عز وجل خلال هذا النوم، فيختم حياته ويختم يومه بذكر الله سبحانه وتعالى، ويكون هذا آخر شيء كان عليه، فإذا توفي على ذلك مات على شيء عظيم من ذكر الله سبحانه، وخاصة إذا كان ختم بقراءة قل يا أيها الكافرون، فيموت على براءة من الكفر، فتبرأ من الكفر، وتبرأ من الشرك وأهله، فيموت على خير حال إذا كان يختم له بذلك.
  """;
  static const String KZakarTime = """
  وقت الصباح يبدأ من نصف الليل الأخير إلى الزوال، وأفضل وقت لأذكار الصباح الإتيان بها من بعد صلاة الصبح حتّى تطلع الشمس، كما أنّ وقت المساء يبدأ من زوال الشمس إلى نهاية نصف الليل الأول، وأفضل وقتٍ لقراءتها من بعد صلاة العصر حتّى تغرب الشمس.
  """;
  static const String KFadlZakar = 'فضل الذكر';
  static const String KDone = 'تـــــم';
  static const String KLocation = 'تحديد المواقيت تلقائياً';
  static const String KSplashHadith =
      '(سبَق المُفرِّدونَ سبَق المُفرِّدونَ )\n قالوا : يا رسولَ اللهِ ما المُفرِّدونَ ؟ \n قال :( الذَّاكرونَ اللهَ كثيرًا والذَّاكراتُ)';
}
